// E:0,
// I:1,
// S:0,
// N:1,
// T:0,
// F:1,
// J:0
// P:1

const qnaList = [{
        mbtiType: [{
                qna: {
                    q: "금쪽이 절친과의 약속 자리에 처음 보는 낯선 친구도 함께 놀자고 한다면?",
                    a: [{
                            answer: "딱히 상관없어 같이 놀자",
                            type: 0,
                        },
                        {
                            answer: "난 내 친구를 만나러 온 거라 솔직히 별로 함께하고 싶지는 않아..",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "금쪽이는 새로운 환경에 놓였을 때 기분이 어떻니? " + "<br>" + "(급식 금쪽이는 반 배치 망한 후 새 학기 교실을 생각해보렴)" + "<br>" + "(직장인 금쪽이는 새 직장에 입사했을 때를 생각해보렴)",
                    a: [{
                            answer: "새로 사람을 사귈 생각에 숨이 턱 막혀",
                            type: 1,
                        },
                        {
                            answer: "새로운 사람들을 만날 생각에 설레고 긴장될 거 같아 두근두근",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "금쪽이는 친구들을 만나서 신나게 놀다가도 인제 그만 집에 가고 싶다는 생각이 들곤 해?",
                    a: [{
                            answer: "아니? 이왕 나온 김에 뽕뽑지 왜 벌써 집 갈 생각을 해?",
                            type: 0,
                        },
                        {
                            answer: "응, 이쯤 놀았음 됐지 적당히 하고 집에 가고 싶을 때가 많아",
                            type: 1,
                        },
                    ],
                }
            },
        ]
    },

    {
        mbtiType: [{
                qna: {
                    q: "셋이 친한 친구 사이에 금쪽이를 제외한 두 명이 크게 싸웠을 때 a 와 b 중 누구의 편을 들 거야?",
                    a: [{
                            answer: "솔직히 평소에 조금 더 친하게 지냈던 친구 편을 들어줄 거 같아",
                            type: 1,
                        },
                        {
                            answer: "셋 다 내 친구니까 내가 두 명의 얘기를 다 들어보고 각자의 잘잘못을 따져 내가 솔로몬의 선택을 내려줄 거야",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "남자친구와 헤어진 친구가 금쪽이랑 만날 때마다 연애 상담을 해달라고 한다면?",
                    a: [{
                            answer: "그게 몇 번이든 더 좋은 사람 만날거라고 진심을 다해 상담해줄 거야",
                            type: 1,
                        },
                        {
                            answer: "어쩌라고 둘이 다시 만날 거 아니야? 대충 위로해줄 거야",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "유치원생 동생이 먹던 포켓몬빵에서 뮤가 나왔어! 닌텐도를 얻으려면 그 스티커가 필요하지만 동생은 닌텐도는 필요없고 스티커만 갖겠다고 고집을부려",
                    a: [{
                            answer: "어린게 뭘알아 그깟 스티커가 뭔상관이야! 동생 잘때 몰래 스티커를 닌텐도DS로 교환한다",
                            type: 0,
                        },
                        {
                            answer: "그래도 동생의 동심은 지켜줘야지.. 닌텐도는 없던걸로하고 동생 이마에 뮤를 붙여준다",
                            type: 1,
                        },
                    ],
                }
            },
        ]
    },
    {
        mbtiType: [{
                qna: {
                    q: "별로 친하지 않은 친구가 간첩이라는 사실을 알았을 때 금쪽이는 어떻게 할 거야?",
                    a: [{
                            answer: "아무도 모르게 친구를 신고하고 포상금까지 덤으로 얻을 거야 개꿀",
                            type: 0,
                        },
                        {
                            answer: "별로 안 친한 사이라 해도. 그간 정이 있으니 그냥 모른 척 넘어가 줄래",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "새로 산 금쪽이 노트북에 친구가 커피를 쏟았다!",
                    a: [{
                            answer: "그래도 이건 100% 네 잘못이니까 노트북값 변상해라",
                            type: 0,
                        },
                        {
                            answer: "친구 좋다는게 뭐냐~ 그냥 새로 하나 또 사고 말지",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "별로 안친하지만 그래도 친구사이였던 프렌드의 범죄사실을 알게 된 금쪽이는?",
                    a: [{
                            answer: "감옥 가서 고생할 친구 생각에 눈물부터 날 거 같은데?ㅜㅜ",
                            type: 1,
                        },
                        {
                            answer: "범죄자는 나와 친구 할 수 없어... 내 이미지까지 망가질 순 없지.. 손절!",
                            type: 0,
                        },
                    ],
                }
            },
        ]
    },
    {
        mbtiType: [{
                qna: {
                    q: "친구들과 떠난 여름휴가! 오전부터 일정이 있지만 해가 넘어가도록 잠만 퍼질러 자는 친구를 본다면?",
                    a: [{
                            answer: " 내 계획이 틀어질까봐 빨리 일어나라고 화를 낼 거 같아",
                            type: 0,
                        },
                        {
                            answer: "좀 자게 놔두고 계획 하나 정도는 재끼고 말 거 같아",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "맛집이라며 친구가 데려간 식당! 금쪽이는 2시간의 웨이팅을 견딜 수 있을까?",
                    a: [{
                            answer: "나는 줄 서서 기다려가며 밥 먹는 거 이해 못 해!!!",
                            type: 1,
                        },
                        {
                            answer: "그래도 원래 여기서 먹기로 계획되어있었으니 몇 시간이던 기다렸다가 꼭 먹을 거야",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "친구와 콘서트를 보러 가던 도중 친구가 급응가가 마렵다고 한다. 하지만 공연 시작까지 남은 시간은 단 10분!",
                    a: [{
                            answer: "헉 너 얼굴 노랗게됐어! 빨리 화장실 다녀와!",
                            type: 1,
                        },
                        {
                            answer: "안돼 시간 못 맞춰서 도착하면 입장이 안 될 수도 있어. 그깟 똥 때문에 콘서트에 늦을 순 없어! 그냥 빨리 목적지로!!",
                            type: 0,
                        },
                    ],
                }
            },
        ]
    },
];
// E:0,
// I:1,
// S:0,
// N:1,
// T:0,
// F:1,
// J:0
// P:1

var infoList = [{
        key: "1111", // INFP
        title: "세상 예민하고 날카로운 금쪽이!",
        desc: "낯가림이 심하고 사람 사귈 때 따지는 게 많으며 한번 싫은 건 끝까지 싫어하는 우리 아이~ 호불호가 명확한 편이라 누가 내 방식에 간섭하면 몹시 화가 나지요? 살면서 예민 충이다 사회 부적응자라 라는 말을 한번은 들어봤을 우리 금쪽아~!! 앞으로는 사회성을 조금 더 길러서 새 나라의 어른이가 되어보자~!",
        imgUrl: "0"
    },
    {
        key: "1110", // INFJ
        title: "두 개의 얼굴을 가진 뒤집힌 양말 같은 금쪽이!",
        desc: "기본적으론 다정다감하지만 낯가림이 심한 우리 금쪽이는요~! 눈치가 더럽게 빨라서 주변의 흐름을 잘 읽어내는 센스쟁이에요. 하지만! 항상 이미지를 심하게 신경 쓰기 때문에 겉으론 웃고 있지만 사실 속으론 욕을 많이 하는 뒤집힌 양말 같은 무서운 우리 아이! 이미지를 챙기는 것도 좋지만 대인배로 거듭나기 위해서는 앞뒤가 똑같은 사람이 되도록 노력해보자 금쪽아~!!",
        imgUrl: "1"
    },
    {
        key: "1101", // INTP
        title: "공감 능력이 모자라 사회성이 많이 딸리는 금쪽이..ㅠㅠ",
        desc: "우리 금쪽이 겉으로는 항상 사회적인 척 하고 있죠? 하지만 실제론 공감 능력이 없는 개인주의자예요.. 성격 스텟을 배분할 때 창의력과 지능에 몰빵해버린 나머지 사회성, 성실성, 외향성 등은… ^^ 사회성을 거의 잃어버렸다고 보면 됩니다. 금쪽아 무리생활을 위해서는 사회성을 조금 더 키워보자!",
        imgUrl: "2"
    },
    {
        key: "1100", //INTJ
        title: "사회활동을 싫어하는 것 치곤 리더 역할 자주 하는 특이한 케이스의 금쪽이..!",
        desc: "또한 굉장히 이기적인 개인주의자인 우리 아이는요~ 인간 친구들에게는 소시오패스로 오해받을 만큼 냉철하지만, 동물들에게는 한없이 친절한 이성적이면서도 또 감성적인 특이한 성격이에요~ 그래도 앞으로 인간들한테 조금은 따스함을 베풀어주자 우리 금쪽앙~!!",
        imgUrl: "3"
    },
    {
        key: "1011", //ISFP
        title: "우리 금쪽이가 천성이 착하다고 많은 사람이 오해하지만, 사실 우리 금쪽이의 내면은 영악함 그 자체에요!!",
        desc: "금쪽이는 남한테 민폐 끼치는걸 싫어하고 누군가와 싸울 땐 매번 감정이 앞서 말을 잘하지 못할 거예요 그쵸? 귀까지 얇아서 주변 분위기에 쉽게 휩쓸리지만 스스로는 줏대 있게 행동했다고 생각하는 못된 버릇이 있는 우리 금쪽이~! 우리 아이 잘못된 합리화는 멈추게 도와주셔야 해요!",
        imgUrl: "4"
    },
    {
        key: "1010", // ISFJ
        title: "소심하지만 외향적인 척 인싸 코스프레하는 우리 금쪽잉~!!",
        desc: "딱히 나서는 것은 싫어하지만 관심받기를 좋아하는 조용한 관종 우리 금쪽이는요~ 남 눈치를 특히나 많이 보는 소심한 아이지만 왜인지 모르게 자꾸 인싸인척 연기하는 귀염둥이예요~ 사실 큰 문제는 없는 우리 금쪽이! 앞으로 건강하게만 자라다오~",
        imgUrl: "5"
    },
    {
        key: "1001", // ISTP
        title: "그냥 만사가 귀찮은 우리 금쪽잉~!!",
        desc: "카톡을 보내면 읽씹해버리는 버르장머리 없는 우리 금쪽이는요~! 항상 효율적인 것만 추구하기 때문에 큰 노력은 지양하는 노.력.절.약.형 친구예요~!! 그래도 본인이 맡은 바는 책임을 지고 잘 해내는 편이니 우리 아이 끝까지 지켜봐 주세요~!",
        imgUrl: "6"
    },
    {
        key: "1000", // ISTJ
        title: "팀플하라고 하면 배 까고 드러눕는 우리 떼쟁이 금쪽이~!!",
        desc: "우리 아이는요~ 친구에게조차도 별로 관심이 없는 딱딱한 성격이고요~ 특히 프로젝트 할 때 이야기가 딴 데로 세는걸 극혐하는 효율충 친구라 평소 융통성 없다는 말을 자주 들었을 거예요~! 그래도 남한테 도움받지 않고 혼자서 척척 해내는 편이니 멀리서만 응원해주세요~!",
        imgUrl: "7"
    },
    {
        key: "0111", // ENFP
        title: "정신이 너무 산만한 우리 금쪽이는요~!!",
        desc: "나서는 걸 좋아해서 모두한테 관심을 받고 싶어 하는 귀여운 친구예요~ 하지만 감정 기복과 변덕이 심해서 일을 크게 만들고 싫증 나서 마무리를 못한 것들이 오조오억개에요..ㅎ 그래도 한가지 큰일을 해내고 나면 죽을 때까지 행복해하니 우리 금쪽이 응원해주세요!",
        imgUrl: "8"
    },
    {
        key: "0110", // ENFJ
        title: "인류애와 정의감이 넘치는 우리금쪽이!",
        desc: "눈치가 빨라 센스가 좋고 그냥 인싸, 리더형 성격을 갖고 있어요~ 인정과 칭찬에는 격하게 춤을 추지만 비판은 잘 받아들이지 못해 예민충이 되어버리는 우리 금쪽이! 그래도 의사소통에 능해 표현하는 것에 천부적인 재능이 있는 우리 아이 너무 시끄럽더라도 너무 미워하진 말아주세요~!!",
        imgUrl: "9"
    },
    {
        key: "0101", // ENTP
        title: "한국에서는 정말 드문 유형의 독립심 강한 이상주의자 우리 금쪽이!",
        desc: "성공하려면 대박적으로 성공하고 싶고 바닥을 치려면 아예 방탕하게 살고 싶어 하는 우리 아이는요~ 중간에서 기는 거 딱 질색! 직설적이고 솔직하게 마음을 표현하는 것에 거리낌이 없는 친구예요~ 다른 사람에게는 관심이 일절 없으며 쪽팔린 일이 있더라도 모르는 사람들 앞이라면 어차피 안 볼 사인데 뭐 어때 하는 쿨한 성격을 갖고있어요. 멋있다 금쪽아!",
        imgUrl: "10"
    },
    {
        key: "0100", // ENTJ
        title: "선천적 리더형 우리 금쪽이~!!",
        desc: "감성팔이를 극혐하고 논리와 팩트로 조지는 우리 아이는요~ 자기애가 강해 열등감을 잘 느끼지 않고요~ 일 잘하는 사람 === 좋은 사람, 일 못하는 사람 === 나쁜 사람 이라는 생각을 가진 단순 무식 일밖에 모르는 금쪽이! 사람 많을 땐 프로패셔널한 정상인이지만 혼자 있을 땐 터무니없는 몽상가가 되기 때문에 우리 금쪽이에게 많은 관심이 필요합니다!",
        imgUrl: "11"
    },
    {
        key: "0011", // ESFP
        title: "성격이 너무 급한 우리 금쪽이..",
        desc: "단순한 성격 때문에 별 걱정 없이 잘 살아가는 아이지만 자존감이 너무 높아 모든 것이 우리 금쪽이 위주이기 때문에 누군가는 이 아이의 기강을 꽉 잡아줄 사람이 필요합니다. 금쪽아, 나를 사랑하는 마음도 좋지만, 타인을 배려할 줄도 알아야 한단다~!",
        imgUrl: "12"
    },
    {
        key: "0010", // ESFJ
        title: "타고난 분위기 메이커! 방청객 유망주 우리 금쪽이~!",
        desc: "리액션해주는 능력이 타고나 친구들의 고민 상담 상대 1순위로 꼽히는 우리 아이는요~ 성격이 굉장히 밝고 모난 구석이 없지만 어색함과 정적을 참지 못하는 조금은 산만한 성격의 금쪽이에요~ 우리 금쪽이는 명상과 차 한 잔의 여유가 꼭 필요합니다!",
        imgUrl: "13"
    }, {
        key: "0001", // ESTP
        title: "자기애 쩔고 근자감도 쩌는 우리 금쪽이~!",
        desc: "혼자만의 세상에 사는 우리 아이는요~ 딱히 스트레스도 안 받고 대충 알아서 잘 살아갑니다! 하지만 공감 능력이 부족하다는 문제점이 있는데요~ 어차피 남한테 관심도 없고 생각하는 것도 귀찮기 때문에 우리 아이에게는 딱히 치명적인 단점은 아니겠네요~ 내버려 두면 알아서 잘 살아가기 때문에 손을 잘 타지 않는 우리 금쪽이랍니다~!",
        imgUrl: "14"
    },
    {
        key: "0000", // ESTJ
        title: "왕고집쟁이 우리 금쪽이~!",
        desc: "항상 남한테 피해 안 주려고 큰 노력을 하면서 나 또한 피해를 받는 것을 극적으로 싫어합니다. 그래서 책잡힐 짓은 전혀 하지 않는 철저함을 보여주며 계획적이고 체계적이기 때문에 좀 피곤한 성격의 금쪽이긴 하네요^^..",
        imgUrl: "15"
    },
];
