// E:0,
// I:1,
// S:0,
// N:1,
// T:0,
// F:1,
// J:0
// P:1

const qnaList = [{
        mbtiType: [{
                qna: {
                    q: "데이트가 없는 주말에 주로 나는",
                    a: [{
                            answer: "집에서 나만의 시간을 보내",
                            type: 1,
                        },
                        {
                            answer: "너무 심심해서 친구랑 약속이라도 잡아서 만나",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "데이트 중 애인의 친구를 길에서 마주친다면?",
                    a: [{
                            answer: "자연스럽게 대화에 스며들 거야",
                            type: 0,
                        },
                        {
                            answer: "인사만 하고 옆에 그냥 가만히 있을래",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "나는 애인과 다툴 때",
                    a: [{
                            answer: "일단 하고 싶은 말을 쏟아내고 나서 생각하는 편",
                            type: 0,
                        },
                        {
                            answer: "내가 할 말을 속으로 생각하고 정리가 되면 차분하게 대화를 이어 나가는 편",
                            type: 1,
                        },
                    ],
                }
            },
        ]
    },

    {
        mbtiType: [{
                qna: {
                    q: "애인의 생일선물 어떤걸 사줄까?",
                    a: [{
                            answer: "평소 애인이 필요로 하던걸 기억해놨다가 선물로 줄 거 같아",
                            type: 1,
                        },
                        {
                            answer: "별로 실용성은 없어도 기억에 남을만한 게 특별한걸 사줄 거야!",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "데이트 중 맛있어 보이는 식당을 발견했다면?",
                    a: [{
                            answer: "간판에 주인장 할머니 사진이 걸려있군! 무조건 맛집이 다 여긴",
                            type: 0,
                        },
                        {
                            answer: "일단 리뷰가 많고 평이 좋은지 네이버에 검색을 해봐야겠어",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "애인이 말끝마다 만약에~를 달고 산다면 기분이 어떨거같아?",
                    a: [{
                            answer: "만약에가 어딨어, 있지도 않은 얘기 그만좀해",
                            type: 0,
                        },
                        {
                            answer: "만약에.. 정말 그렇게 된다면 너무 열받을거같아 진짜 화나니까 만약에라도 그런말은 하지마!",
                            type: 1,
                        },
                    ],
                }
            },
        ]
    },
    {
        mbtiType: [{
                qna: {
                    q: "애인과 사소한 일로 다퉜을 때 나는",
                    a: [{
                            answer: "혼자 부들부들 감정이 먼저 앞서서 말도 제대로 못하는 편이다",
                            type: 1,
                        },
                        {
                            answer: "매번 그래왔듯이 내 감정을 똑뿌러지게 얘기한다.",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "열심히 준비한 기념일 이벤트! 내가듣고싶은 칭찬은?",
                    a: [{
                            answer: "바쁠 텐데 이런 것까지 준비하다니! 정말 대단하다~",
                            type: 0,
                        },
                        {
                            answer: "너무 감동했어! 사랑해 나 눈물 날 것 같아",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "데이트 중 애인 표정이 뾰로통하다.. 하지만 이유를 모르겠다면?",
                    a: [{
                            answer: "뭐가 심통났는지 솔직하게 말을 하라고 할거야",
                            type: 0,
                        },
                        {
                            answer: "뭐가 문제인지는 모르겠지만…. 분위기를 잘 풀어보려고 노력한다.",
                            type: 1,
                        },
                    ],
                }
            },
        ]
    },
    {
        mbtiType: [{
                qna: {
                    q: "데이트 코스는 주로 누가 짜?",
                    a: [{
                            answer: "최소한 데이트 전날에는 우리가 어디 가서 뭘 먹을지 정도는 내가 짜는 편이야",
                            type: 0,
                        },
                        {
                            answer: "일단 만나서 생각하는 편이야",
                            type: 1,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "데이트 중 애인이 계획에 없던 곳에 가자고 할 때",
                    a: [{
                            answer: "별 생각없다. 그래 여기서 데이트하자!",
                            type: 1,
                        },
                        {
                            answer: "우리 원래 다른 곳 가기로 했잖아 여긴 다음에 가자~",
                            type: 0,
                        },
                    ],
                }
            },
            {
                qna: {
                    q: "애인이 우리 집에 잠시 들린다고 했을 때",
                    a: [{
                            answer: "대충 보이는곳만 치울거야",
                            type: 1,
                        },
                        {
                            answer: "뭐?! 지금 온다고?? 화장실부터 방 구석구석 빡빡 청소한다.",
                            type: 0,
                        },
                    ],
                }
            },
        ]
    },
];
// E:0,
// I:1,
// S:0,
// N:1,
// T:0,
// F:1,
// J:0
// P:1

var infoList = [{
        key: "1111", // INFP
        title: "<h3>나의 궁합 코드 : 1111</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0110, 0100 / 안 맞는 코드 : 0001</p>",
        desc1: "상상력이 풍부한 스타일로써 연애를 시작하기 전 걱정부터 하는 편입니다. 내가 상대방을 좋아하는 만큼 나도 똑같이 좋아해 주길 바라며 애교는 정말 없는 편입니다. 눈에 콩깍지가 씌면 상대의 단점을 쉽게 넘기는 편이고 사랑을 할 때는 논리보다는 감성이 우선적이지만 그 관계가 끝나면 미련을 갖기보다는 완벽하게 인연을 단호하게 끊어내는 편입니다.",
        desc2: "감정이 풍부하고 배려심이 깊은 로맨티시스트인 당신은 정서적 교감을 추구하기 때문에 이상적이면서 낭만적인 사람에게 끌립니다. 현실주의적인 사람들과는 불편한 관계가 될 수도 있으므로 이상적이면서 언변에 능숙해 당신에게 상처를 잘 주지 않을 상대와 궁합이 잘 맞습니다.",
        imgUrl: "0"
    },
    {
        key: "0111", // ENFP
        title: "<h3>나의 궁합 코드 : 0111</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1110, 1100 / 안 맞는 코드 : 1001</p>",
        desc1: "콩깍지가 심하므로 좋아하는 사람에게 깊이 빠져드는 편입니다. 평소 사람을 좋아하기 때문에 편견이 없는 편이며 사랑을 할 때는 열정적이기 때문에 그만큼 빨리 식기도 한다는 단점이 있습니다. 솔직한 성격 때문에 좋아하는 사람에게는 적극적으로 다가가며 이것저것 퍼주지만 정작 본인에게 돌아오는 게 없다면 쉽게 상처를 받는 편입니다.",
        desc2: "당신의 즉흥적이고 재미있는 제안을 좋아하며 거기에 계획과 구체성을 붙여주는 성격 유형과 잘 맞습니다. 그런 상대와는 서로의 부족함을 채워주는 상호보완의 관계가 될 수 있으므로 연애 상대로 아주 적합합니다.",
        imgUrl: "1"
    },
    {
        key: "0010", // ESFJ
        title: "<h3>나의 궁합 코드 : 0010</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1011, 1001 / 안 맞는 코드 : 1100</p>",
        desc1: "사회성이 좋고 다정해서 평소 인기가 많은 편입니다. 현실적인 성향이 강하기 때문에 상대와 나의 현재 조건이 맞지 않는다면 호감이 가는 사람이라도 단호하게 마음을 접어버리는 편이며 애인으로 관계를 발전시켜나가기까지 많이 고민하지만 연애가 시작되면 장기적으로 하는 경우가 많은 스타일입니다.",
        desc2: "남 눈치를 많이 보고 귀가 얇지만, 이거에 대해 비판하거나 너무 현실적인 조언만 쏟아붓는 유형은 잘 맞지 않습니다. 하지만 감정적으로 잘 받쳐주고 져주면서 애정 표현을 많이 해줄 수 있는 유형과는 궁합이 잘 맞습니다.",
        imgUrl: "2"
    },
    {
        key: "1010", //ISFJ
        title: "<h3>나의 궁합 코드 : 1010</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0011, 0001 / 안 맞는 코드 : 0100</p>",
        desc1: "상대에게 거의 맞춰주고 인내심이 강한 편입니다. 서운한 건 얘기를 잘 못 하고 왜 이렇게 착하냐는 얘기를 밥 먹듯이 듣습니다. 현모양처 같은 성격 유형이고 상대의 기분이 안 좋아 보일 때면 괜히 내가 뭘 잘못한 것 같아 걱정하는 성격입니다.",
        desc2: "감각적인 유형과는 궁합이 좋은 편이지만 직관적이고 감정적인 사람과는 학을 떼는 편입니다. 또한 편견이 있고 허세가 있는 사람을 극혐하기 때문에 유하고 겸손한 성격과 잘 맞습니다.",
        imgUrl: "3"
    },
    {
        key: "1011", //ISFP
        title: "<h3>나의 궁합 코드 : 1011</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0110, 0010, 0000 / 안 맞는 코드 : 0101</p>",
        desc1: "자유로움을 추구하기 때문에 타인의 통제에 극도로 예민한 편이고, 마음을 여는 시간도 다소 걸립니다. 하지만 한번 사랑에 빠지면 올인하는 스타일이고 상대가 바라는 걸 이뤄주고 싶은 램프의 요정 지니 같은 유형입니다. 또한 결정장애가 있어 나를 이끌어줄 리더쉽 강한 사람에게 끌리는 편입니다.",
        desc2: "상대에게 많은 에너지를 쏟아붓고 친절과 사랑을 베풀고 배려하지만 그만큼 쉽게 방전되는 편입니다. 또한 새롭고 즉흥적이면서 재밌는 걸 좋아하는 성격이기 때문에 이런 자유로움을 이해해줄 상대와 궁합이 잘 맞습니다.",
        imgUrl: "4"
    },
    {
        key: "0011", // ESFP
        title: "<h3>나의 궁합 코드 : 0011</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1010, 1000 / 안 맞는 코드 : 1101</p>",
        desc1: "즉흥적이고 사교적이기 때문에 쉽게 사랑에 빠지고 금방 콩깍지가 벗겨지는 편 입니다. 데이트를 자주 하는 걸 좋아하며 친구 같은 연애를 선호합니다. 하지만 바람기가 있어 장기연애에는 취약하며 상대와의 만남이 익숙해질 때쯤 다른 사람으로 갈아타는 성향이 있습니다.",
        desc2: "내향적인 성격과 좋은 궁합이며 어디로 튈지 모르는 탱탱볼 같은 당신의 돌발행동을 잘 받아주고 이해해주는 유형과 궁합이 잘 맞습니다.",
        imgUrl: "5"
    },
    {
        key: "1101", // INTP
        title: "<h3>나의 궁합 코드 : 1101</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0100, 0000 / 안 맞는 코드 : 0011</p>",
        desc1: "오글거림과 허세를 싫어하고 밀당을 극혐하는 타입입니다. 상대의 다정함과 따뜻함보다는 재치에 더 끌리는 편이며 연인에게 딱히 의존하려 하지 않는 독립적인 성향을 보입니다. 이성을 볼 때 외모와 성격을 많이 보는 편인데 무조건 이쁘고 잘생긴 사람을 좋아한다기보다는 본인만의 외모 취향이 확고한 편이라 이상형의 모습이 극히 주관적일 수 있습니다. 기념일에 꽃 같은 실용성 없는 선물을 받는 걸 싫어하며 연애를 할 때도 본인의 일과 사생활에 지장을 받는 것을 아주 싫어합니다.",
        desc2: "감정적인 이해와 공감보다는 현실적이고 논리적인 것에 관심을 두는 현실적인 상대와 궁합이 잘 맞습니다. 하지만 연애, 사랑이 1순위가 아닌 편이며 연애와 어울리지 않는 부분 성향이 있으므로, 독신주의자가 은근히 많은 편입니다.",
        imgUrl: "6"
    },
    {
        key: "1110", // INFJ
        title: "<h3>나의 궁합 코드 : 1110</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0111, 0101 / 안 맞는 코드 : 0000</p>",
        desc1: "타인에 대한 기준이 엄격해 사람을 쉽게 사귀지 못하는 성격이지만 막상 친해진다면 깊은 관계를 이어 나가는 것에 문제가 없습니다. 눈치가 빠르지만 상대에게 잘 티는 내지 않으며 나 자신이 상처받기를 싫어하기 때문에 항상 내 감정을 표현하기 전에 굉장히 신중한 편입니다. 만남은 신중하지만 이별할 때 한번 결심하면 가차 없이 실행에 옮기는 화끈한 성격이기도 합니다.",
        desc2: "일단 당신은 현실보다 이상을 꿈꾸기 때문에 타인과 연애를 시작하는 것이 조금은 어렵습니다. 시작을 신중하게 고려하는 타입이기 때문에 한 번 연애를 하면 상대와의 깊은 관계를 추구하면서 격한 애정을 쏟는 경향이 있습니다. 하지만 많은 사랑을 베푼 만큼 미련도 없는 당신은 한번 실망을 느끼면 인연을 빨리 정리하는 냉철한 편이기도 합니다.",
        imgUrl: "7"
    },
    {
        key: "0110", // ENFJ
        title: "<h3>나의 궁합 코드 : 0110</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1111, 1011 / 안 맞는 코드 : 1000</p>",
        desc1: "당신에게 사랑이란 꽃과 밤하늘같이 낭만적인 것입니다. 한번 사랑에 빠지면 다른 일들은 일단 뒷전인 상태가 됩니다. 당신을 나타내는 키워드인 정열, 배려, 헌신과 같은 특성이 연애 스타일에서도 나타나기 때문에 상대가 자신과 같은 노력을 보여주지 않는다면 큰 실망과 상처를 받기도 합니다. 결혼을 결심하면 바로 계획을 시작할 만큼 추진력이 굉장히 강한 편입니다.",
        desc2: "상대방을 잘 배려하고 이해하는 성격이기 때문에 약간은 소극적인 유형과 잘 맞습니다. 당신은 베풀기 좋아하고 사회성이 좋으므로 연애할 때 예민한 상대의 마음을 잘 알아주는 편입니다.",
        imgUrl: "8"
    },
    {
        key: "0101", // ENTP
        title: "<h3>나의 궁합 코드 : 0101</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1110, 1100 / 안 맞는 코드 : 1011</p>",
        desc1: "이성에게 끼 부리는 방법과 요령에 있어서 도가 튼 사람이기 때문에 이성을 꼬시기를 잘하고 썸도 잘 탑니다. 지적이면서 허세 없는 이성을 좋아하고 연애할 때는 서로의 사생활을 존중하는 연애를 원하는 편입니다. 내가 먼저 관심이 가는 사람에게 다가가는 건 재밌고 즐겁지만, 누군가 먼저 다가오거나 너무 잘해주면 부담을 많이 느끼는 타입입니다.",
        desc2: "박학다식하고 다양한 분야에 흥미를 갖는 사람과 궁합이 잘 맞으며 본인과 똑같이 지적인 열망이 크고 자신감이 있는 사람과는 천생연분입니다",
        imgUrl: "9"
    },
    {
        key: "0000", // ESTJ
        title: "<h3>나의 궁합 코드 : 0000</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1011, 1001 / 안 맞는 코드 : 1110</p>",
        desc1: "연애할 때 애정표현이나 오글거리는 표현에 약하며 직설적인 화법 때문에 상대와 갈등이 생기기는 쉽지만 사소한 것으로는 잘 싸우지 않는 편입니다. 상대에게 의지하려 하지 않는 성향이 강하며 딱히 헌신하지도 않습니다. 하지만 바람기는 0에 가까우며 가식이 없고 항상 쿨한 매력을 보여주는 유형입니다.",
        desc2: "지적이면서도 자신감 있는 사람과 궁합이 잘 맞으며 자유분방한 영혼과는 상극입니다. 밀당이라곤 하나도 모르는 솔직 담백한 성격 때문에 지나치게 감성적인 사람과는 잘 맞지 않습니다.",
        imgUrl: "10"
    },
    {
        key: "1000", // ISTJ
        title: "<h3>나의 궁합 코드 : 1000</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0011, 0001 / 안 맞는 코드 : 0110</p>",
        desc1: "자존심이 강해서 좋아하는 상대가 있어도 관심 없는 척을 합니다. 그래서 고백도 먼저 하지 않으며 정말 큰 호감이 있는 경우에만 아주 조금씩 표현 하는 편입니다. 과묵하고 책임감 있는 사람을 좋아하고 충동적인 사람은 싫어합니다. 또한 갈등이 생겼을 때는 무조건 이기려고 하는 경향이 있습니다.",
        desc2: "서로 약점이 있더라도 감싸주고 강점을 알아봐 주며 상호 간의 신경전을 불필요로 하므로 감정소비 거의 없는 0011, 0001 유형과 궁합이 잘 맞습니다.",
        imgUrl: "11"
    },
    {
        key: "1100", // INTJ
        title: "<h3>나의 궁합 코드 : 1100</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0111, 0101 / 안 맞는 코드 : 0010</p>",
        desc1: "첫인상에 엄격하고 극도의 효율성을 추구하기 때문에 사람을 사귈 때도 디테일하게 따지는 편입니다. 감성적인 사람을 싫어하고 지적이고 똑 부러지는 상대에게 호감을 느낍니다. 또한 상대방이 당신에게 의지하는걸 아주 싫어하기 때문에 내면이 단단한 사람에게 끌립니다. 연애를 할 때는 친구 사이 같은 편한 감정보다는 삶의 방향성이 같은 현실적인 상대에게 더 끌리는 편입니다.",
        desc2: "거짓말을 극혐하고 연인 사이에 신뢰를 가장 중요하게 생각하기 때문에 솔직한 사람을 좋아하며 주관이 굉장히 뚜렷해서 가치관이 맞지 않으면 상대와 대화를 할 수가 없습니다. 공감능력이 많이 부족해서 눈치껏 상대를 위로하는 것이 익숙하지 않기 때문에 원하는 것이 있으면 바로바로 말해주는 사람과 잘 맞습니다. 또한, 자신만의 시간을 존중해주고 사생활도 보장해주는 상대를 만나야 이상적인 연애를 할 수 있습니다.",
        imgUrl: "12"
    },
    {
        key: "1001", // ISTP
        title: "<h3>나의 궁합 코드 : 1001</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 0010, 0000 / 안 맞는 코드 : 0111</p>",
        desc1: "실용과 논리를 중요시하기 때문에 타인의 감정에 공감하는 능력이 현저히 부족하고 자신의 감정에 휘둘리는 것을 싫어하기 때문에 항상 이성적인 상태를 유지하고자 합니다. 또한 연애를 할 때는 직접적이고 솔직한 태도를 보여주는 편입니다. 공감과 이해로 상대를 위해주기보다는 논리적인 해결책을 마련해줌으로써 도움을 주는 것을 선호하기 때문에 너무 감성적인 상대와는 잘 맞지 않을 수 있습니다.",
        desc2: "계획 없이 즉흥적이며 돌발행동을 종종 하는 본인과 비슷한 유형과 궁합이 좋습니다. 모두 구체적인 계획 없이 공기의 흐름대로 인생을 사는 유형들은 서로 이해하고 보듬어줄 수 있습니다.",
        imgUrl: "13"
    }, {
        key: "0001", // ESTP
        title: "<h3>나의 궁합 코드 : 0001</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1010, 1000 / 안 맞는 코드 : 1111</p>",
        desc1: "적응력이 강하고 문제해결 능력이 뛰어난 편이며 무겁고 진중한 관계보다는 즐겁고 재밌는 연애를 선호합니다. 자유로운 영혼을 갖고 있기 때문에 상대가 나를 구속하거나 나의 문제해결 방식에 대해 훈수를 두는 것을 극도로 싫어합니다. 매사에 열정적인 만큼 애정 표현이나 스킨쉽에도 적극적인 편입니다.",
        desc2: "공감과 배려가 몸에 배어 있는 사람과 궁합이 잘 맞으며 그 상대가 정신적 지주가 될 가능성이 큽니다. 하지만 어떤 유형이든 당신을 구속하려 들거나 통제하려 한다면 큰 갈등이 발생할 수 있으므로 당신을 자연 방생 할 만큼의 그릇을 가진 사람을 만나는 것이 좋습니다.",
        imgUrl: "14"
    },
    {
        key: "0100", // ENTJ
        title: "<h3>나의 궁합 코드 : 0100</h3>" + "<br>" + "<p>나랑 잘 맞는 코드 : 1111, 1101 / 안 맞는 코드 : 1010</p>",
        desc1: "의외로 연애할 때는 다정한 모습을 보여주는 당신은 승리욕이 강하고 카톡도 안읽씹 읽씹이 습관이지만 연애할 때 만큼은 가끔 상대에게 져주기도 합니다. 하지만 용건 없이 길게 전화기를 붙들고 통화하는 걸 싫어하며 연인 사이에서도 연락은 용건만 간단히 하자는 주의입니다.",
        desc2: "안정감 있는 연애를 추구하고 내가 말하지 않아도 내 불만과 속마음을 알아줬으면 하는 스타일이기 때문에 조심스러운 성격이면서도 언변에 능숙한 사람과 찰떡궁합입니다.",
        imgUrl: "15"
    },
];
